perf_output/after/memcached-1.5.12/16/memcached-1.5.12_workloadc_16_after_load.txt
[WARN]  Running against a source checkout. In order to get our runtime dependencies we'll have to invoke Maven. Depending on the state of your system, this may take ~30-45 seconds
[DEBUG]  Running 'mvn -pl site.ycsb:memcached-binding -am package -DskipTests dependency:build-classpath -DincludeScope=compile -Dmdep.outputFilterFile=true'
WARNING: An illegal reflective access operation has occurred
WARNING: Illegal reflective access by com.google.inject.internal.cglib.core.$ReflectUtils$1 (file:/usr/share/maven/lib/guice.jar) to method java.lang.ClassLoader.defineClass(java.lang.String,byte[],int,int,java.security.ProtectionDomain)
WARNING: Please consider reporting this to the maintainers of com.google.inject.internal.cglib.core.$ReflectUtils$1
WARNING: Use --illegal-access=warn to enable warnings of further illegal reflective access operations
WARNING: All illegal access operations will be denied in a future release
java -cp /proj/proxyweb-PG0/adona/YCSB/memcached/conf:/proj/proxyweb-PG0/adona/YCSB/memcached/target/memcached-binding-0.18.0-SNAPSHOT.jar:/root/.m2/repository/org/apache/htrace/htrace-core4/4.1.0-incubating/htrace-core4-4.1.0-incubating.jar:/root/.m2/repository/org/hdrhistogram/HdrHistogram/2.1.4/HdrHistogram-2.1.4.jar:/root/.m2/repository/log4j/log4j/1.2.17/log4j-1.2.17.jar:/root/.m2/repository/org/codehaus/jackson/jackson-mapper-asl/1.9.13/jackson-mapper-asl-1.9.13.jar:/root/.m2/repository/net/spy/spymemcached/2.11.4/spymemcached-2.11.4.jar:/root/.m2/repository/org/codehaus/jackson/jackson-core-asl/1.9.4/jackson-core-asl-1.9.4.jar:/proj/proxyweb-PG0/adona/YCSB/core/target/core-0.18.0-SNAPSHOT.jar site.ycsb.Client -db site.ycsb.db.MemcachedClient -threads 16 -s -P workloads/workloadc -p memcached.hosts=localhost:11211 -load
Command line: -db site.ycsb.db.MemcachedClient -threads 16 -s -P workloads/workloadc -p memcached.hosts=localhost:11211 -load
YCSB Client 0.18.0-SNAPSHOT

Loading workload...
log4j:WARN No appenders could be found for logger (org.apache.htrace.core.Tracer).
log4j:WARN Please initialize the log4j system properly.
log4j:WARN See http://logging.apache.org/log4j/1.2/faq.html#noconfig for more info.
Starting test.
2021-08-11 17:38:14:938 0 sec: 0 operations; est completion in 0 second 
2021-08-11 17:38:15.058 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:38:15.058 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:38:15.058 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
[...]
2021-08-11 17:38:15.059 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:38:15.061 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:38:15.062 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:38:15.062 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2021-08-11 17:38:15.063 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:38:15.063 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:38:15.064 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:38:15.065 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:38:15.066 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:38:15.067 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:38:15.068 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:38:15.068 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
Error inserting, not retrying any more. number of attempts: 1Insertion Retry Limit: 0
Error inserting, not retrying any more. number of attempts: 1Insertion Retry Limit: 0
Error inserting, not retrying any more. number of attempts: 1Insertion Retry Limit: 0
[...]
2021-08-11 17:38:15.180 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:38:15.180 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:38:15.180 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:38:15.181 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:38:15.180 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:38:15.183 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:38:15.184 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:38:15.185 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:38:15.185 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:38:15.186 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:38:15.187 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:38:15.188 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:38:15.188 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:38:15.189 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:38:15.189 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:38:15.190 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:38:15:185 0 sec: 0 operations; est completion in 106751991167300 days 15 hours [CLEANUP: Count=16, Max=6947, Min=5596, Avg=6368.25, 90=6875, 99=6947, 99.9=6947, 99.99=6947] [INSERT: Count=0, Max=0, Min=9223372036854775807, Avg=NaN, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT-FAILED: Count=16, Max=92991, Min=88320, Avg=91696, 90=92863, 99=92991, 99.9=92991, 99.99=92991] 
[OVERALL], RunTime(ms), 247
[OVERALL], Throughput(ops/sec), 0.0
[TOTAL_GCS_G1_Young_Generation], Count, 0
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 16
[CLEANUP], AverageLatency(us), 6368.25
[CLEANUP], MinLatency(us), 5596
[CLEANUP], MaxLatency(us), 6947
[CLEANUP], 95thPercentileLatency(us), 6899
[CLEANUP], 99thPercentileLatency(us), 6947
[INSERT], Operations, 0
[INSERT], AverageLatency(us), NaN
[INSERT], MinLatency(us), 9223372036854775807
[INSERT], MaxLatency(us), 0
[INSERT], 95thPercentileLatency(us), 0
[INSERT], 99thPercentileLatency(us), 0
[INSERT], Return=ERROR, 16
[INSERT-FAILED], Operations, 16
[INSERT-FAILED], AverageLatency(us), 91696.0
[INSERT-FAILED], MinLatency(us), 88320
[INSERT-FAILED], MaxLatency(us), 92991
[INSERT-FAILED], 95thPercentileLatency(us), 92927
[INSERT-FAILED], 99thPercentileLatency(us), 92991

 Performance counter stats for 'system wide':

       75341822856      cycles                                                        (66.65%)
       15049894014      branches                                                      (66.68%)
         553939632      branch-misses             #    3.68% of all branches          (66.69%)
       15064490424      branch-loads                                                  (66.69%)
         556603130      branch-load-misses                                            (66.67%)
         686713594      L1-icache-load-misses                                         (66.64%)

      12.444047773 seconds time elapsed